Функция Сформировать(Начало, Конец) Экспорт
    Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда ВызватьИсключение "Отчет формируется за один календарный месяц."; КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент,
 | СУММА(Результат) КАК Сумма
 | ИЗ РегистрРасчета.Премии
 | ГДЕ ПериодРегистрации МЕЖДУ &Начало И &Конец И Активность
 | СГРУППИРОВАТЬ ПО Сотрудник");
    Запрос.УстановитьПараметр("Начало", НачалоМесяца(Начало));
    Запрос.УстановитьПараметр("Конец", КонецМесяца(Начало));
    
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
