Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Учет.Заблокировать("РегистрБухгалтерии.Управленческий");
    Движения.Управленческий.Записывать = Истина;
    Движения.Управленческий.Очистить();
    Для Каждого Стр Из Проводки Цикл
        Если Не ЗначениеЗаполнено(Стр.СчетДт) Или Не ЗначениеЗаполнено(Стр.СчетКт) Тогда
            ВызватьИсключение "Заполните дебет и кредит проводки.";
        КонецЕсли;
        Д = Движения.Управленческий.Добавить();
        ЗаполнитьЗначенияСвойств(Д, Стр);
        Д.Период = Дата;
    КонецЦикла;
КонецПроцедуры
