Функция Сформировать(Начало, Конец, Подразделение, Характеристика = Неопределено) Экспорт
    
    Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, Свойство,
 | СУММА(КоличествоНачальныйОстаток) КАК НачальныйОстатокКоличество,
 | СУММА(КоличествоПриход) КАК ПриходКоличество, СУММА(КоличествоРасход) КАК РасходКоличество,
 | СУММА(КоличествоКонечныйОстаток) КАК КонечныйОстатокКоличество,
 | СУММА(СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
 | СУММА(СтоимостьПриход) КАК Приход, СУММА(СтоимостьРасход) КАК Расход,
 | СУММА(СтоимостьКонечныйОстаток) КАК КонечныйОстаток
 | ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение)
 | СГРУППИРОВАТЬ ПО Номенклатура, Свойство");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало));
    Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Запрос.УстановитьПараметр("Подразделение", Подразделение);
    Данные = Запрос.Выполнить().Выгрузить();
    Если Не ЗначениеЗаполнено(Характеристика) Тогда
        Характеристика = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Производитель", Истина);
    КонецЕсли;
    Данные.Колонки.Добавить("Производитель", Новый ОписаниеТипов("Строка"), ?(ЗначениеЗаполнено(Характеристика), Строка(Характеристика), "Производитель"));
    Запрос.Текст = "ВЫБРАТЬ Свойство, Значение ИЗ РегистрСведений.ЗначенияСвойств
    | ГДЕ Свойство В (&Свойства) И Характеристика = &Характеристика";
    Запрос.УстановитьПараметр("Свойства", Данные.ВыгрузитьКолонку("Свойство"));
    Запрос.УстановитьПараметр("Характеристика", Характеристика);
    Значения = Запрос.Выполнить().Выгрузить();
    Для Каждого Стр Из Данные Цикл
        Найденные = Значения.НайтиСтроки(Новый Структура("Свойство", Стр.Свойство));
        Стр.Производитель = ?(Найденные.Количество() > 0, Строка(Найденные[0].Значение), Строка(Стр.Свойство));
    КонецЦикла;
    Данные.Сортировать("Производитель, Номенклатура");
    Возврат Данные;
КонецФункции
