Функция Сформировать(ДатаНачала, ДатаОкончания) Экспорт

	Месяц = НачалоМесяца(ДатаНачала);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Начало", Месяц);
	Запрос.УстановитьПараметр("Конец", КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ОсновныеНачисления.Премия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(Начисления.Стаж) КАК Стаж,
	|	МАКСИМУМ(Начисления.ПроцентПремии) КАК Процент,
	|	СУММА(Начисления.Результат) КАК Сумма
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидРасчета = &Премия
	|	И Начисления.ПериодДействияНачало >= &Начало
	|	И Начисления.ПериодДействияНачало <= &Конец
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник";
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Сотрудник");
	Результат.Колонки.Добавить("Стаж", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Процент", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Пока Выборка.Следующий() Цикл
		Строка = Результат.Добавить();
		Строка.Сотрудник = Выборка.Сотрудник;
		Строка.Стаж = ?(Выборка.Стаж = Null, 0, Выборка.Стаж);
		Строка.Процент = ?(Выборка.Процент = Null, 0, Выборка.Процент);
		Строка.Сумма = ?(Выборка.Сумма = Null, 0, Выборка.Сумма);
	КонецЦикла;
	Результат.Сортировать("Сотрудник");
	Возврат Результат;

КонецФункции
