#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
    КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    НачалоПериода = НачалоМесяца(НачалоПериода); КонецПериода = КонецМесяца(НачалоПериода);
    Данные = Отчеты.ПремииЗаМесяц.Сформировать(НачалоПериода, КонецПериода);
    Результат = Учет.ПечатьОтчета(Данные, "Месяц: " + Формат(НачалоПериода, "ДФ=MMMM yyyy"), "ПремииЗаМесяц");
КонецПроцедуры
