#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
    КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    
    Данные = Отчеты.ПродажиТоваровИАналогов.Сформировать(НачалоПериода, КонецПериода);
    Результат = Учет.ПечатьОтчета(Данные, "Продажи товаров и аналогов с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy"), "ПродажиТоваровИАналогов");
КонецПроцедуры
