Функция Данные(Начало, Конец) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, СУММА(КоличествоОборот) КАК Количество,
    |СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Продажа,
    |СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    |ИЗ РегистрНакопления.ПродажиОУ.Обороты(&Начало, &Конец, , )
    |СГРУППИРОВАТЬ ПО Номенклатура УПОРЯДОЧИТЬ ПО Номенклатура.Наименование");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало)); Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
