#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

&НаКлиенте
Процедура КоличествоИлиЦенаПриИзменении(Элемент)
    Стр = Элементы.СписокНоменклатуры.ТекущиеДанные;
    Если Стр <> Неопределено Тогда Стр.Сумма = Окр(Стр.Количество * Стр.Цена, 2); КонецЕсли;
    ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
    Стр = Элементы.СписокНоменклатуры.ТекущиеДанные;
    Если Стр <> Неопределено И Стр.Количество <> 0 Тогда Стр.Цена = Окр(Стр.Сумма / Стр.Количество, 2); КонецЕсли;
    ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтог()
    Объект.СуммаПоДокументу = 0;
    Для Каждого Стр Из Объект.СписокНоменклатуры Цикл
        Объект.СуммаПоДокументу = Объект.СуммаПоДокументу + Стр.Сумма;
    КонецЦикла;
КонецПроцедуры

