#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
    КонецПериода = КонецМесяца(НачалоПериода);
    Характеристика = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Производитель", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    
    Данные = Отчеты.ВедомостьПоПодразделению.Сформировать(НачалоПериода, КонецПериода, Подразделение, Характеристика);
    Результат = Учет.ПечатьОтчета(Данные, "Ведомость по подразделению " + Строка(Подразделение) + " с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy"), "ВедомостьПоПодразделению");
КонецПроцедуры
