Функция Данные(Начало, Конец) Экспорт
    Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда ВызватьИсключение "Отчет о премиях формируется за один календарный месяц"; КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК ТрудовойСтаж, МАКСИМУМ(Процент) КАК ПроцентПремии, СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления ГДЕ ПериодРегистрации = &Месяц И ВидРасчета = &Премия И Активность
    |СГРУППИРОВАТЬ ПО Сотрудник УПОРЯДОЧИТЬ ПО Сотрудник.Наименование");
    Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Начало)); Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ОсновныеНачисления.Премия);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
