Функция Сформировать(ДатаНачала, ДатаОкончания) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Начало", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("Конец", КонецДня(ДатаОкончания));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты.Номенклатура КАК Номенклатура,
	|	СУММА(Обороты.КоличествоОборот) КАК Количество,
	|	СУММА(Обороты.СебестоимостьОборот) КАК Себестоимость,
	|	СУММА(Обороты.ВыручкаОборот) КАК Продажа
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , ) КАК Обороты
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Номенклатура";
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Себестоимость", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Продажа", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Прибыль", Новый ОписаниеТипов("Число"));
	Пока Выборка.Следующий() Цикл
		Строка = Результат.Добавить();
		Строка.Номенклатура = Выборка.Номенклатура;
		Строка.Количество = Выборка.Количество;
		Строка.Себестоимость = Выборка.Себестоимость;
		Строка.Продажа = Выборка.Продажа;
		Строка.Прибыль = Выборка.Продажа - Выборка.Себестоимость;
	КонецЦикла;
	Результат.Сортировать("Номенклатура");
	Возврат Результат;

КонецФункции
