&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Начало = НачалоМесяца(ТекущаяДата()); Конец = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Если Начало > Конец Тогда ВызватьИсключение "Начало периода позже его окончания"; КонецЕсли;
    Отчет = РеквизитФормыВЗначение("Объект");
    Данные = Отчет.Данные(Начало, Конец, Подразделение);
    ТабДок = Новый ТабличныйДокумент;
    УчетСервер.НарисоватьОтчет(ТабДок, Данные, "ВедомостьОУ", Начало, Конец, Подразделение);
КонецПроцедуры
