Функция Сформировать(Начало, Конец) Экспорт

    Запрос = Новый Запрос("ВЫБРАТЬ Т.Номенклатура, Т.Продано,
    | СУММА(Т.Количество) КАК Количество, СУММА(Т.Себестоимость) КАК Себестоимость,
    | СУММА(Т.Выручка) КАК Выручка, СУММА(Т.Выручка - Т.Себестоимость) КАК Прибыль
    | ИЗ (ВЫБРАТЬ
    | ВЫБОР КОГДА Заказано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ Заказано КОНЕЦ КАК Номенклатура,
    | ВЫБОР КОГДА Продано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ Продано КОНЕЦ КАК Продано,
    | КоличествоКт КАК Количество, Сумма КАК Себестоимость, Выручка
    | ИЗ РегистрБухгалтерии.Управленческий
    | ГДЕ Период МЕЖДУ &Начало И &Конец И Активность
    | И СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибылиУбытки)
    | И СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары)
    | ОБЪЕДИНИТЬ ВСЕ
    | ВЫБРАТЬ Заказано,
    | ВЫБОР КОГДА Продано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА Заказано ИНАЧЕ Продано КОНЕЦ,
    | 0, 0, Сумма
    | ИЗ РегистрБухгалтерии.Управленческий
    | ГДЕ Период МЕЖДУ &Начало И &Конец И Активность
    | И Заказано <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
    | И СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели)
    | И СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибылиУбытки)) КАК Т
    | СГРУППИРОВАТЬ ПО Т.Номенклатура, Т.Продано");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало));
    Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
