Функция Данные(Начало, Конец, Подразделение) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Ост.Номенклатура, Ост.Свойство КАК Характеристика,
    |ЕСТЬNULL(Произв.Производитель, Ост.Номенклатура.Производитель) КАК Производитель,
    |СУММА(Ост.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    |СУММА(Ост.СтоимостьПриход) КАК Приход, СУММА(Ост.СтоимостьРасход) КАК Расход,
    |СУММА(Ост.СтоимостьКонечныйОстаток) КАК КонечныйОстаток,
    |СУММА(Ост.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    |СУММА(Ост.КоличествоПриход) КАК ПриходКоличество, СУММА(Ост.КоличествоРасход) КАК РасходКоличество,
    |СУММА(Ост.КоличествоКонечныйОстаток) КАК КонечноеКоличество
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК Ост
    |ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ Свойство, МАКСИМУМ(ВЫРАЗИТЬ(Значение КАК СТРОКА(150))) КАК Производитель
    |ИЗ РегистрСведений.ЗначенияСвойств ГДЕ Характеристика.Наименование = &ИмяХарактеристики СГРУППИРОВАТЬ ПО Свойство) КАК Произв
    |ПО Ост.Свойство = Произв.Свойство
    |СГРУППИРОВАТЬ ПО Ост.Номенклатура, Ост.Свойство, ЕСТЬNULL(Произв.Производитель, Ост.Номенклатура.Производитель)
    |УПОРЯДОЧИТЬ ПО Производитель, Ост.Номенклатура.Наименование, Ост.Свойство.Наименование");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало)); Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Запрос.УстановитьПараметр("Подразделение", Подразделение); Запрос.УстановитьПараметр("ИмяХарактеристики", "Производитель");
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

