&НаКлиенте
Процедура Заполнить(Команда)
    ВыполнитьОбработку();
    Сообщить("График подразделения заполнен.");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработку()
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, Подразделение, ЧасовВДень);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ВыходныеДни = "6,7"; ЧасовВДень = 8;
    ВыборПериода.ДатаНачала = НачалоГода(ТекущаяДата()); ВыборПериода.ДатаОкончания = КонецГода(ТекущаяДата());
КонецПроцедуры
