Функция Сформировать(ДатаНачала, ДатаОкончания) Экспорт

	Виды = Новый Массив;
	Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Продано);
	КорСчета = Новый Массив;
	КорСчета.Добавить(ПланыСчетов.Управленческий.Товары);
	КорСчета.Добавить(ПланыСчетов.Управленческий.Покупатели);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Начало", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("Конец", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Прибыль", ПланыСчетов.Управленческий.ПрибылиУбытки);
	Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);
	Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
	Запрос.УстановитьПараметр("Виды", Виды);
	Запрос.УстановитьПараметр("КорСчета", КорСчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты.Субконто1 КАК Номенклатура,
	|	Обороты.Субконто2 КАК Продано,
	|	СУММА(ВЫБОР КОГДА Обороты.КорСчет = &Товары ТОГДА Обороты.КоличествоОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР КОГДА Обороты.КорСчет = &Товары ТОГДА Обороты.СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
	|	СУММА(ВЫБОР КОГДА Обороты.КорСчет = &Покупатели ТОГДА Обороты.СуммаОборотКт ИНАЧЕ 0 КОНЕЦ) КАК Продажа
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(
	|			&Начало,
	|			&Конец,
	|			,
	|			Счет = &Прибыль,
	|			&Виды,
	|			,
	|			КорСчет В (&КорСчета),
	|			) КАК Обороты
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Субконто1,
	|	Обороты.Субконто2";
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Продано");
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Себестоимость", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Продажа", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Прибыль", Новый ОписаниеТипов("Число"));
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество = 0 И Выборка.Себестоимость = 0 И Выборка.Продажа = 0 Тогда
			Продолжить;
		КонецЕсли;
		Строка = Результат.Добавить();
		Строка.Номенклатура = Выборка.Номенклатура;
		Строка.Продано = Выборка.Продано;
		Строка.Количество = Выборка.Количество;
		Строка.Себестоимость = Выборка.Себестоимость;
		Строка.Продажа = Выборка.Продажа;
		Строка.Прибыль = Выборка.Продажа - Выборка.Себестоимость;
	КонецЦикла;
	Результат.Сортировать("Номенклатура, Продано");
	Возврат Результат;

КонецФункции
