Функция Данные(Начало, Конец) Экспорт
    УчетСервер.НастроитьУчет();
    Запрос = Новый Запрос("ВЫБРАТЬ СубконтоДт1 КАК Номенклатура, СубконтоКт1 КАК Продано,
    |КоличествоОборотКт КАК Количество, СуммаОборот КАК Себестоимость, 0 КАК Продажа
    |ПОМЕСТИТЬ Обороты
    |ИЗ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&Начало, &Конец, , СчетДт = &Прибыль, , СчетКт = &Товары, , )
    |ОБЪЕДИНИТЬ ВСЕ
    |ВЫБРАТЬ СубконтоКт1, СубконтоКт2, 0, 0, СуммаОборот
    |ИЗ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&Начало, &Конец, , СчетДт = &Покупатели, , СчетКт = &Прибыль, , );
    |ВЫБРАТЬ Номенклатура, Продано, СУММА(Количество) КАК Количество, СУММА(Себестоимость) КАК Себестоимость,
    |СУММА(Продажа) КАК Продажа, СУММА(Продажа - Себестоимость) КАК Прибыль
    |ИЗ Обороты СГРУППИРОВАТЬ ПО Номенклатура, Продано УПОРЯДОЧИТЬ ПО Номенклатура, Продано");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало)); Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары); Запрос.УстановитьПараметр("Прибыль", ПланыСчетов.Управленческий.ПрибылиУбытки);
    Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
