Процедура ПередЗаписью(Отказ, Замещение)
    Если Отбор.Период.Использование Тогда Отбор.Период.Установить(НачалоНедели(Отбор.Период.Значение)); КонецЕсли;
    Для Каждого Строка Из ЭтотОбъект Цикл
        Строка.Период = НачалоНедели(Строка.Период);
        Если Не ЗначениеЗаполнено(Строка.СистемныйБлок) Или Не ЗначениеЗаполнено(Строка.Деталь) Или Строка.Количество < 0 Тогда
            ВызватьИсключение "Спецификация должна содержать системный блок, деталь и неотрицательное количество";
        КонецЕсли;
        Если Строка.СистемныйБлок = Строка.Деталь Тогда ВызватьИсключение "Блок не может включать самого себя"; КонецЕсли;
    КонецЦикла;
КонецПроцедуры
